Autodesk.Revit.DB.Ceiling.GetCeilingGridLines(System.Boolean)
Get the geometric representation of the ceiling grid, optionally including the ceiling boundary.
includeBoundary:
Include the boundary of the ceiling with the grid lines.
Returns:
The curves representing the ceiling grid, optionally including the ceiling boundary.
Since:
2025.3